[{
        "导演": "陈嘉上",
        "data": [{ "电影名称": "老鼠爱上猫", "年份": 2003, "类型": "喜剧 / 动作 / 爱情", "评分": 5.5, "票房": 23000 },
            { "电影名称": "画壁", "年份": 2011, "类型": "剧情 / 动作 / 爱情 / 奇幻", "评分": 4.4, "票房": 15064 },
            { "电影名称": "画皮 畫皮", "年份": 2008, "类型": "剧情 / 动作 / 惊悚", "评分": 6.5, "票房": 20470 },
            { "电影名称": "四大名捕", "年份": 2012, "类型": "动作 / 爱情 / 悬疑 / 武侠 / 古装", "评分": 5, "票房": 19985 },
            { "电影名称": "四大名捕2", "年份": 2013, "类型": "动作 / 悬疑 / 奇幻 / 武侠 / 古装", "评分": 4.8, "票房": 17428 },
            { "电影名称": "四大名捕大结局", "年份": 2014, "类型": "动作 / 爱情 / 悬疑 / 武侠 / 古装", "评分": 4.7, "票房": 19234 },
        ]
    },
    {
        "导演": "陈可辛 ",
        "data": [
            { "电影名称": "武侠", "年份": 2011, "类型": "剧情 / 动作 / 悬疑 / 武侠", "评分": 6.6, "票房": 17021 },
            { "电影名称": "中国合伙人", "年份": 2013, "类型": "剧情", "评分": 7.6, "票房": 53879.9 },
            { "电影名称": "亲爱的", "年份": 2014, "类型": "剧情 / 家庭", "评分": 8.3, "票房": 34517.2 },
            { "电影名称": "投名状", "年份": 2007, "类型": "剧情 / 动作 / 战争 / 古装", "评分": 6.9, "票房": 2346 },
            { "电影名称": "如果·爱", "年份": 2005, "类型": "剧情 / 爱情 / 歌舞", "评分": 7.6, "票房": 3007 },
        ]
    },
    {
        "导演": "杜琪峰",
        "data": [{ "电影名称": "大事件", "年份": 2004, "导演": "杜琪峰", "类型": "剧情 / 动作 / 犯罪", "评分": 6.5, "票房": 650 },
            { "电影名称": "毒战 毒戰", "年份": 2012, "导演": "杜琪峰", "类型": "剧情 / 动作 / 犯罪", "评分": 7.2, "票房": 14695 },
            { "电影名称": "高海拔之恋Ⅱ", "年份": 2012, "导演": "杜琪峰", "类型": "爱情", "评分": 5.8, "票房": 2148.8 },
            { "电影名称": "盲探", "年份": 2013, "导演": "杜琪峰", "类型": "喜剧 / 爱情 / 悬疑 / 惊悚 / 犯罪", "评分": 7.1, "票房": 21419 },
            { "电影名称": "单身男女2 單身男女II", "年份": 2014, "导演": "杜琪峰", "类型": "喜剧 / 爱情", "评分": 5.4, "票房": 19874.9 },
            { "电影名称": "华丽上班族 華麗上班族", "年份": 2015, "导演": "杜琪峰", "类型": "剧情 / 喜剧 / 爱情 / 歌舞", "评分": 6, "票房": 4750 },
            { "电影名称": "三人行", "年份": 2016, "导演": "杜琪峰", "类型": "剧情 / 动作 / 犯罪", "评分": 5.9, "票房": 10054 },
            { "电影名称": "大块头有大智慧 大隻佬", "年份": 2003, "导演": "杜琪峰", "类型": "剧情 / 动作 / 惊悚", "评分": 6.4, "票房": 1401 },
        ]
    }, {
        "导演": "尔冬升",
        "data": [
            { "电影名称": "千杯不醉", "年份": 2005, "导演": "尔冬升", "类型": "喜剧 / 爱情", "评分": 6.3, "票房": 579.4 },
            { "电影名称": "枪王之王", "年份": 2010, "导演": "尔冬升", "类型": "动作 / 悬疑 / 惊悚", "评分": 6.6, "票房": 12658 },
            { "电影名称": "大魔术师 大魔術師", "年份": 2012, "导演": "尔冬升", "类型": "剧情 / 喜剧 / 爱情 / 奇幻", "评分": 6.6, "票房": 17364.1 },
            { "电影名称": "我是路人甲", "年份": 2015, "导演": "尔冬升", "类型": "剧情 / 喜剧", "评分": 7.2, "票房": 6319.3 },
        ]
    },
    {
        "导演": "林超贤",
        "tdata": [
            { "电影名称": "证人", "年份": 2008, "导演": "林超贤", "类型": "动作 / 惊悚", "评分": 7.2, "票房": 1547.6 },
            { "电影名称": "线人 線人", "年份": 2010, "导演": "林超贤", "类型": "剧情 / 动作 / 惊悚", "评分": 7.3, "票房": 5276.3 },
            { "电影名称": "火龙对决", "年份": 2010, "导演": "林超贤", "类型": "动作 / 惊悚", "评分": 6.1, "票房": 1843 },
            { "电影名称": "逆战", "年份": 2012, "导演": "林超贤", "类型": "剧情 / 动作 / 惊悚 / 犯罪", "评分": 6.4, "票房": 12940.3 },
            { "电影名称": "激战 激戰", "年份": 2013, "导演": "林超贤", "类型": "剧情 / 动作 / 运动", "评分": 7.8, "票房": 11789 },
            { "电影名称": "魔警", "年份": 2014, "导演": "林超贤", "类型": "动作 / 悬疑 / 惊悚 / 犯罪", "评分": 5.9, "票房": 10833 },
            { "电影名称": "破风 破風", "年份": 2015, "导演": "林超贤", "类型": "剧情 / 运动", "评分": 7.2, "票房": 14529.1 },
            { "电影名称": "湄公河行动", "年份": 2016, "导演": "林超贤", "类型": "动作 / 犯罪", "评分": 8, "票房": 118453.2 },
        ]
    }, {
        "导演": "刘伟强",
        "data": [
            { "电影名称": "精武风云·陈真", "年份": 2010, "导演": "刘伟强", "类型": "动作", "评分": 6, "票房": 14243.0 },
            { "电影名称": "不再让你孤单", "年份": 2011, "导演": "刘伟强", "类型": "剧情 / 爱情", "评分": 7, "票房": 1999 },
            { "电影名称": "血滴子", "年份": 2012, "导演": "刘伟强", "类型": "动作 / 武侠 / 古装", "评分": 4.6, "票房": 7187 },
            { "电影名称": "建军大业", "年份": 2007, "导演": "刘伟强", "类型": "战争", "评分": null, "票房": 38158 },
            { "电影名称": "伤城", "年份": 2006, "导演": "刘伟强", "类型": "剧情 / 惊悚 / 犯罪", "评分": 6.8, "票房": 7431 },
        ]
    },
    {
        "导演": "刘镇伟",
        "data": [
            { "电影名称": "情癫大圣", "年份": 2005, "导演": "刘镇伟", "类型": "剧情 / 喜剧 / 动作 / 爱情 / 科幻 / 奇幻", "评分": 5.3, "票房": 5000 },
            { "电影名称": "越光宝盒", "年份": 2010, "导演": "刘镇伟", "类型": "喜剧 / 奇幻", "评分": 5.2, "票房": 1027 },
            { "电影名称": "出水芙蓉", "年份": 2010, "导演": "刘镇伟", "类型": "喜剧 / 运动", "评分": 5, "票房": 842 },
            { "电影名称": "东成西就2011", "年份": 2011, "导演": "刘镇伟", "类型": "喜剧 / 动作 / 爱情 / 音乐 / 奇幻", "评分": 3.9, "票房": 7497 },
            { "电影名称": "大话天仙", "年份": 2014, "导演": "刘镇伟", "类型": "喜剧 / 奇幻 / 古装", "评分": 3, "票房": 2962 },
            { "电影名称": "大话西游3", "年份": 2016, "导演": "刘镇伟", "类型": "喜剧 / 爱情 / 奇幻", "评分": 3.6, "票房": 36606 },
        ]
    }, {
        "导演": "彭浩翔",
        "data": [
            { "电影名称": "春娇与志明 春嬌與志明", "年份": 2012, "导演": "彭浩翔", "类型": "剧情 / 喜剧 / 爱情", "评分": 7.3, "票房": 7059 },
            { "电影名称": "撒娇女人最好命", "年份": 2014, "导演": "彭浩翔", "类型": "喜剧 / 爱情", "评分": 5.8, "票房": 23048 },
            { "电影名称": "人间·小团圆 香港仔", "年份": 2014, "导演": "彭浩翔", "类型": "剧情", "评分": 5.3, "票房": 1430 },
            { "电影名称": "春娇救志明 春嬌救志明", "年份": 2017, "导演": "彭浩翔", "类型": "剧情 / 喜剧 / 爱情", "评分": 7.2, "票房": 17483 },
        ]
    }, {
        "导演": "王家卫",
        "data": [{ "电影名称": "2046", "年份": 2004, "导演": "王家卫", "类型": "剧情 / 爱情 / 科幻 / 奇幻", "评分": 7.4, "票房": 2.3 },
            { "电影名称": "蓝莓之夜 My Blueberry Nights", "年份": 2007, "导演": "王家卫", "类型": "剧情 / 爱情", "评分": 7.6, "票房": 1207 },
            { "电影名称": "东邪西毒：终极版 東邪西毒終極版", "年份": 2008, "导演": "王家卫", "类型": "剧情 / 动作 / 爱情", "评分": 8.7, "票房": 2580 },
            { "电影名称": "一代宗师 一代宗師", "年份": 2013, "导演": "王家卫", "类型": "剧情 / 动作 / 传记", "评分": 7.7, "票房": 28923 },
        ]
    },
    {
        "导演": "王晶",
        "data": [{ "电影名称": "大内密探灵灵狗 大內密探靈靈狗", "年份": 2009, "导演": "王晶", "类型": "喜剧", "评分": 5, "票房": 10022.3 },
            { "电影名称": "金钱帝国", "年份": 2009, "导演": "王晶", "类型": "犯罪", "评分": 6.3, "票房": 1906.2 },
            { "电影名称": "美丽密令", "年份": 2010, "导演": "王晶", "类型": "喜剧", "评分": 5.4, "票房": 3740 },
            { "电影名称": "财神客栈", "年份": 2011, "导演": "王晶", "类型": "喜剧 / 动作 / 悬疑 / 古装", "评分": 5.3, "票房": 10244.5 },
            { "电影名称": "大上海", "年份": 2012, "导演": "王晶", "类型": "剧情 / 动作", "评分": 6.6, "票房": 14975 },
            { "电影名称": "嫁个100分男人", "年份": 2012, "导演": "王晶", "类型": "喜剧 / 爱情", "评分": 4, "票房": 2526 },
            { "电影名称": "王牌逗王牌", "年份": 2016, "导演": "王晶", "类型": "喜剧 / 动作 / 冒险", "评分": 3.3, "票房": 26034 },
            { "电影名称": "笑功震武林", "年份": 2013, "导演": "王晶 ", "类型": "喜剧 / 动作", "评分": 4.6, "票房": 7022 },
            { "电影名称": "澳门风云3 賭城風雲III", "年份": 2016, "导演": "王晶 ", "类型": "喜剧 / 动作", "评分": 3.9, "票房": 111818 },
            { "电影名称": "澳门风云2 賭城風雲II", "年份": 2015, "导演": "王晶 ", "类型": "喜剧 / 动作", "评分": 5.6, "票房": 97491 },
            { "电影名称": "澳门风云 賭城風雲", "年份": 2014, "导演": "王晶", "类型": "喜剧 / 动作", "评分": 5.7, "票房": 52489 },
        ]
    },
    {
        "导演": "吴宇森",
        "data": [{ "电影名称": "赤壁(上) ", "年份": 2008, "导演": "吴宇森", "类型": "剧情 / 动作 / 历史 / 战争 / 冒险", "评分": 6.3, "票房": 27686 },
            { "电影名称": "赤壁(下) ", "年份": 2009, "导演": "吴宇森", "类型": "剧情 / 动作 / 历史 / 战争", "评分": 6.4, "票房": 24353 },
            { "电影名称": "太平轮(上) ", "年份": 2014, "导演": "吴宇森", "类型": "剧情 / 爱情 / 战争", "评分": 5.8, "票房": 19542 },
            { "电影名称": "太平轮(下)·彼岸 ", "年份": 2015, "导演": "吴宇森", "类型": "剧情 / 爱情 / 灾难", "评分": 6.5, "票房": 5105.2 },
        ]
    },
    {
        "导演": "徐克",
        "data": [{ "电影名称": "七剑", "年份": 2005, "导演": "徐克", "类型": "剧情 / 动作 / 武侠 / 古装", "评分": 5.8, "票房": 8345.3 },
            { "电影名称": "女人不坏", "年份": 2008, "导演": "徐克", "类型": "喜剧", "评分": 6, "票房": 1983.0 },
            { "电影名称": "深海寻人", "年份": 2008, "导演": "徐克", "类型": "剧情 / 爱情 / 惊悚 / 恐怖 / 奇幻", "评分": 5.8, "票房": 1962 },
            { "电影名称": "狄仁杰之通天帝国", "年份": 2010, "导演": "徐克", "类型": "剧情 / 动作 / 悬疑 / 犯罪 / 古装", "评分": 6.4, "票房": 28260.0 },
            { "电影名称": "龙门飞甲", "年份": 2011, "导演": "徐克", "类型": "动作 / 武侠 / 古装", "评分": 6.7, "票房": 54011.0 },
            { "电影名称": "狄仁杰之神都龙王", "年份": 2013, "导演": "徐克", "类型": "动作 / 悬疑 / 犯罪 / 古装", "评分": 6.5, "票房": 60077.0 },
            { "电影名称": "智取威虎山", "年份": 2014, "导演": "徐克", "类型": "动作 / 战争 / 冒险", "评分": 7.7, "票房": 88208 },
            { "电影名称": "西游伏妖篇", "年份": 2017, "导演": "徐克", "类型": "喜剧 / 动作 / 奇幻 / 古装", "评分": 5.6, "票房": 165592 },
        ]
    },
    {
        "导演": "叶伟信",
        "data": [{ "电影名称": "大城小事", "年份": 2004, "导演": "叶伟信", "类型": "剧情 / 爱情", "评分": 6.3, "票房": 802.4 },
            { "电影名称": "龙虎门", "年份": 2006, "导演": "叶伟信", "类型": "剧情 / 动作", "评分": 5.7, "票房": 5360.6 },
            { "电影名称": "导火线 導火線", "年份": 2007, "导演": "叶伟信", "类型": "动作", "评分": 6.9, "票房": 3461.9 },
            { "电影名称": "叶问 葉問", "年份": 2008, "导演": "叶伟信", "类型": "剧情 / 动作 / 传记 / 历史", "评分": 7.5, "票房": 8487.0 },
            { "电影名称": "叶问2：宗师传奇", "年份": 2010, "导演": "叶伟信", "类型": "动作 / 传记 / 历史", "评分": 7.2, "票房": 23109.0 },
            { "电影名称": "开心魔法", "年份": 2011, "导演": "叶伟信", "类型": "喜剧 / 奇幻", "评分": 4.2, "票房": 2004.3 },
            { "电影名称": "倩女幽魂", "年份": 2011, "导演": "叶伟信", "类型": "剧情 / 惊悚 / 奇幻 / 古装", "评分": 5.3, "票房": 14093.1 },
            { "电影名称": "叶问3", "年份": 2015, "导演": "叶伟信", "类型": "剧情 / 动作 / 传记 / 历史", "评分": 6.3, "票房": 77031 },
            { "电影名称": "杀破狼·贪狼 殺破狼‧貪狼", "年份": 2017, "导演": "叶伟信", "类型": "剧情 / 动作", "评分": 7.5, "票房": 8424.4 },
            { "电影名称": "冲上云霄 衝上雲霄", "年份": 2015, "导演": "叶伟信", "类型": "剧情 / 爱情", "评分": 4.4, "票房": 15631.4 },
        ]
    },
    {
        "导演": "周星驰",
        "data": [{ "电影名称": "功夫", "年份": 2004, "导演": "周星驰", "类型": "喜剧 / 动作 / 犯罪 / 奇幻", "评分": 7.9, "票房": 2560.2 },
            { "电影名称": "长江七号", "年份": 2008, "导演": "周星驰", "类型": "剧情 / 喜剧 / 科幻 / 家庭 / 奇幻", "评分": 6.3, "票房": 3398 },
            { "电影名称": "美人鱼", "年份": 2016, "导演": "周星驰", "类型": "喜剧 / 爱情 / 奇幻", "评分": 6.8, "票房": 124699.1 },
            { "电影名称": "西游降魔篇", "年份": 2013, "导演": "周星驰", "类型": "喜剧 / 奇幻 / 冒险", "评分": 7.1, "票房": 339212.8 }
        ]
    }
]